marriage_app/app/controllers/dateideas_controller.rb

SELECT "dateideas".* FROM "dateideas"
---
  def index
    @dateideas = Dateidea.all.sample