marriage_app/app/controllers/api/v1/dateideas_controller.rb

  def index
    @dateideas = Dateidea.all
---
SELECT "dateideas".* FROM "dateideas"

  def create
    @dateidea = Dateidea.new(dateidea_params)

    if @dateidea.save
---
INSERT INTO "dateideas" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "xxdfasdfadsfadfadfsss"], ["created_at", "2018-05-30 21:44:55.553825"], ["updated_at", "2018-05-30 21:44:55.553825"]]